#### Terraform Plan 📖
```
module.iam.aws_iam_account_password_policy.strict[0]: Refreshing state... [id=iam-account-password-policy]
module.iam.aws_iam_group.frontend_developers: Refreshing state... [id=fuckwork-frontend-developers]
module.iam.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.iam.aws_iam_group.backend_developers: Refreshing state... [id=fuckwork-backend-developers]
module.iam.aws_iam_group.devops: Refreshing state... [id=fuckwork-devops]
module.iam.aws_iam_policy.frontend_developers: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-frontend-developers-policy]
module.auth.aws_secretsmanager_secret.facebook_oauth: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-facebook-oauth-MX1wb7]
module.iam.aws_iam_group.administrators: Refreshing state... [id=fuckwork-administrators]
module.iam.aws_iam_role.ec2_backend: Refreshing state... [id=fuckwork-dev-ec2-backend-role]
data.aws_caller_identity.current: Read complete after 0s [id=302222527269]
module.auth.aws_iam_role.cognito_sms: Refreshing state... [id=fuckwork-dev-cognito-sms]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=302222527269]
module.iam.aws_iam_role.rds_monitoring: Refreshing state... [id=fuckwork-dev-rds-monitoring-role]
module.iam.aws_iam_group.readonly: Refreshing state... [id=fuckwork-readonly]
module.auth.aws_secretsmanager_secret.linkedin_oauth: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-linkedin-oauth-3LDMM0]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.auth.aws_secretsmanager_secret.github_oauth: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-github-oauth-bIh85Z]
module.iam.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::302222527269:oidc-provider/token.actions.githubusercontent.com]
module.auth.data.aws_region.current: Reading...
module.auth.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.auth.aws_secretsmanager_secret.google_oauth: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-google-oauth-SNHyf1]
module.iam.aws_iam_group_policy_attachment.administrators: Refreshing state... [id=fuckwork-administrators-20251221092723673700000003]
module.auth.aws_secretsmanager_secret_version.facebook_oauth: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-facebook-oauth-MX1wb7|terraform-20251226224139379900000007]
module.iam.aws_iam_policy.backend_developers: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-backend-developers-policy]
module.iam.aws_iam_policy.ec2_backend: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-dev-ec2-backend-policy]
module.iam.aws_iam_policy.github_actions_deploy: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-dev-github-actions-deploy-policy]
module.iam.aws_iam_role.terraform_execution: Refreshing state... [id=fuckwork-dev-terraform-execution-role]
module.iam.aws_iam_policy.require_mfa[0]: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-require-mfa-policy]
module.iam.aws_iam_group_policy_attachment.readonly: Refreshing state... [id=fuckwork-readonly-20251221092723717800000005]
module.iam.aws_iam_group_policy_attachment.frontend_developers: Refreshing state... [id=fuckwork-frontend-developers-2025122109272384780000000b]
module.iam.aws_iam_role.github_actions_deploy: Refreshing state... [id=fuckwork-dev-github-actions-deploy-role]
module.iam.aws_iam_role.github_actions_terraform: Refreshing state... [id=fuckwork-github-actions-terraform-role]
module.iam.aws_iam_instance_profile.ec2_backend: Refreshing state... [id=fuckwork-dev-ec2-backend-profile]
module.iam.aws_iam_role_policy_attachment.rds_monitoring: Refreshing state... [id=fuckwork-dev-rds-monitoring-role-20251221092723779700000007]
module.auth.aws_secretsmanager_secret_version.linkedin_oauth: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-linkedin-oauth-3LDMM0|terraform-20251227045414949900000001]
module.auth.aws_secretsmanager_secret_version.google_oauth: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-google-oauth-SNHyf1|terraform-20251226224139382900000008]
module.auth.aws_secretsmanager_secret_version.github_oauth: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-github-oauth-bIh85Z|terraform-20251226224139354100000006]
module.auth.aws_iam_role_policy.cognito_sms: Refreshing state... [id=fuckwork-dev-cognito-sms:fuckwork-dev-cognito-sms-policy]
module.iam.aws_iam_role_policy_attachment.ec2_backend: Refreshing state... [id=fuckwork-dev-ec2-backend-role-20251221092723808800000008]
module.iam.aws_iam_group_policy_attachment.backend_developers: Refreshing state... [id=fuckwork-backend-developers-20251221092723669900000002]
module.auth.aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_WYlLzbaux]
module.iam.aws_iam_group_policy_attachment.backend_developers_mfa[0]: Refreshing state... [id=fuckwork-backend-developers-20251221092723718000000006]
module.iam.aws_iam_group_policy_attachment.administrators_mfa[0]: Refreshing state... [id=fuckwork-administrators-20251221092723712700000004]
module.iam.aws_iam_group_policy_attachment.frontend_developers_mfa[0]: Refreshing state... [id=fuckwork-frontend-developers-20251221092723833700000009]
module.iam.aws_iam_group_policy_attachment.devops_mfa[0]: Refreshing state... [id=fuckwork-devops-2025122109272383460000000a]
module.iam.aws_iam_group_policy_attachment.readonly_mfa[0]: Refreshing state... [id=fuckwork-readonly-20251221092723669800000001]
module.iam.aws_iam_role_policy_attachment.github_actions_deploy: Refreshing state... [id=fuckwork-dev-github-actions-deploy-role-2025122109272420190000000d]
module.iam.aws_iam_policy.devops: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-devops-policy]
module.iam.aws_iam_role_policy_attachment.terraform_admin: Refreshing state... [id=fuckwork-dev-terraform-execution-role-2025122109272393570000000c]
module.iam.aws_iam_policy.github_actions_terraform: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-github-actions-terraform-policy]
module.iam.aws_iam_group_policy_attachment.devops: Refreshing state... [id=fuckwork-devops-2025122109272604430000000e]
module.iam.aws_iam_role_policy_attachment.github_actions_terraform: Refreshing state... [id=fuckwork-github-actions-terraform-role-2025122109272611450000000f]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=fuckwork-dev]
module.auth.aws_cognito_identity_provider.facebook[0]: Refreshing state... [id=us-east-1_WYlLzbaux:Facebook]
module.auth.aws_cognito_identity_provider.google[0]: Refreshing state... [id=us-east-1_WYlLzbaux:Google]
module.auth.aws_cognito_identity_provider.linkedin[0]: Refreshing state... [id=us-east-1_WYlLzbaux:LinkedIn]
module.auth.aws_cognito_user_pool_client.frontend: Refreshing state... [id=3cafqu6vn90p9s0qnqn7i1puf0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.auth.aws_cognito_identity_provider.facebook[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cognito_identity_provider" "facebook" {
      - attribute_mapping = {
          - "email"    = "email"
          - "name"     = "name"
          - "username" = "id"
        } -> null
      - id                = "us-east-1_WYlLzbaux:Facebook" -> null
      - idp_identifiers   = [] -> null
      - provider_details  = {
          - "api_version"                   = "v18.0"
          - "attributes_url"                = "https://graph.facebook.com/v18.0/me?fields="
          - "attributes_url_add_attributes" = "true"
          - "authorize_scopes"              = "email,public_profile"
          - "authorize_url"                 = "https://www.facebook.com/v18.0/dialog/oauth"
          - "client_id"                     = (sensitive value)
          - "client_secret"                 = (sensitive value)
          - "token_request_method"          = "GET"
          - "token_url"                     = "https://graph.facebook.com/v18.0/oauth/access_token"
        } -> null
      - provider_name     = "Facebook" -> null
      - provider_type     = "Facebook" -> null
      - user_pool_id      = "us-east-1_WYlLzbaux" -> null
    }

  # module.auth.aws_cognito_identity_provider.google[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cognito_identity_provider" "google" {
      - attribute_mapping = {
          - "email"    = "email"
          - "name"     = "name"
          - "picture"  = "picture"
          - "username" = "sub"
        } -> null
      - id                = "us-east-1_WYlLzbaux:Google" -> null
      - idp_identifiers   = [] -> null
      - provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields="
          - "attributes_url_add_attributes" = "true"
          - "authorize_scopes"              = "email openid profile"
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth"
          - "client_id"                     = (sensitive value)
          - "client_secret"                 = (sensitive value)
          - "oidc_issuer"                   = "https://accounts.google.com"
          - "token_request_method"          = "POST"
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token"
        } -> null
      - provider_name     = "Google" -> null
      - provider_type     = "Google" -> null
      - user_pool_id      = "us-east-1_WYlLzbaux" -> null
    }

  # module.auth.aws_cognito_identity_provider.linkedin[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cognito_identity_provider" "linkedin" {
      - attribute_mapping = {
          - "email"    = "email"
          - "name"     = "name"
          - "username" = "sub"
        } -> null
      - id                = "us-east-1_WYlLzbaux:LinkedIn" -> null
      - idp_identifiers   = [] -> null
      - provider_details  = {
          - "attributes_request_method"     = "GET"
          - "attributes_url"                = "https://api.linkedin.com/v2/userinfo"
          - "attributes_url_add_attributes" = "false"
          - "authorize_scopes"              = "openid profile email"
          - "authorize_url"                 = "https://www.linkedin.com/oauth/v2/authorization"
          - "client_id"                     = (sensitive value)
          - "client_secret"                 = (sensitive value)
          - "jwks_uri"                      = "https://www.linkedin.com/oauth/openid/jwks"
          - "oidc_issuer"                   = "https://www.linkedin.com/oauth"
          - "token_url"                     = "https://www.linkedin.com/oauth/v2/accessToken"
        } -> null
      - provider_name     = "LinkedIn" -> null
      - provider_type     = "OIDC" -> null
      - user_pool_id      = "us-east-1_WYlLzbaux" -> null
    }

  # module.auth.aws_cognito_user_pool_client.frontend will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "frontend" {
        id                                            = "3cafqu6vn90p9s0qnqn7i1puf0"
        name                                          = "fuckwork-dev-frontend-client"
      ~ supported_identity_providers                  = [
          - "Facebook",
          - "Google",
          - "LinkedIn",
            # (1 unchanged element hidden)
        ]
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.auth.aws_secretsmanager_secret_version.facebook_oauth must be replaced
-/+ resource "aws_secretsmanager_secret_version" "facebook_oauth" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-facebook-oauth-MX1wb7" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-facebook-oauth-MX1wb7|terraform-20251226224139379900000007" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20251226224139379900000007" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.auth.aws_secretsmanager_secret_version.github_oauth must be replaced
-/+ resource "aws_secretsmanager_secret_version" "github_oauth" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-github-oauth-bIh85Z" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-github-oauth-bIh85Z|terraform-20251226224139354100000006" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20251226224139354100000006" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.auth.aws_secretsmanager_secret_version.google_oauth must be replaced
-/+ resource "aws_secretsmanager_secret_version" "google_oauth" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-google-oauth-SNHyf1" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-google-oauth-SNHyf1|terraform-20251226224139382900000008" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20251226224139382900000008" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.auth.aws_secretsmanager_secret_version.linkedin_oauth must be replaced
-/+ resource "aws_secretsmanager_secret_version" "linkedin_oauth" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-linkedin-oauth-3LDMM0" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:302222527269:secret:fuckwork-dev-linkedin-oauth-3LDMM0|terraform-20251227045414949900000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20251227045414949900000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 1 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```